![png](https://assets.codingdojo.com/boomyeah/company_209/chapter_3569/handouts/chapter3569_5431_sakila-db-model.png)

In [ ]:
import pymysql
pymysql.install_as_MySQLdb()

In [ ]:
import pandas as pd

In [ ]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine("mysql+pymysql://root:root@Dhia-PC:3306/sakila" , pool_pre_ping=True)

In [ ]:
engine

In [ ]:
#GRANTS FOR 'root'@'Dhia-PC';

In [ ]:
#SHOW GRANTS FOR 'root'@'Dhia-PC';

In [ ]:
#q = """SHOW GRANTS FOR 'root'@'Dhia-PC';"""
#pd.read_sql(q, engine)

Queries

In [ ]:
q1 = """SELECT customer.first_name, customer.last_name, customer.email, customer.address_id, city.city
FROM customer
JOIN address USING (address_id)
JOIN city USING (city_id)
WHERE city_id = 312;"""
pd.read_sql(q1, engine)

In [ ]:
q2 = """SELECT category.name, film.title, film.description, film.release_year, film.rating, film.special_features
FROM film
JOIN film_category ON film.film_id = film_category.film_id
JOIN category ON film_category.category_id = category.category_id
WHERE category.name = 'Comedy';"""
pd.read_sql(q2, engine)

In [ ]:
q3 = """SELECT actor.last_name, film.title, film.release_year 
FROM actor
JOIN film_actor ON film_actor.actor_id = actor.actor_id
JOIN film ON film.film_id = film_actor.film_id
WHERE actor.last_name = 'Lollobrigida';
"""
pd.read_sql(q3, engine)

In [ ]:
q4 = """SELECT actor.first_name, actor.last_name, film.title
FROM actor
JOIN film_actor ON film_actor.actor_id = actor.actor_id
JOIN film ON film.film_id = film_actor.film_id
WHERE film.title = 'Bingo Talented';
"""
pd.read_sql(q4, engine)

In [11]:
q5 = """SELECT DISTINCT customer_id, amount
FROM payment
WHERE amount > 2 * (SELECT AVG(amount) FROM payment);
"""
pd.read_sql(q5, engine)

     customer_id  amount
0              1    9.99
1              2   10.99
2              3    8.99
3              3   10.99
4              4    8.99
..           ...     ...
651          595    9.99
652          595   10.99
653          597    8.99
654          599    9.99
655          599    8.99

[656 rows x 2 columns]

In [12]:
q6 = """SELECT customer.first_name, customer.last_name, COUNT(payment.customer_id) as num_payments
FROM customer
JOIN payment ON payment.customer_id = customer.customer_id
GROUP BY customer.first_name, customer.last_name
ORDER BY num_payments desc
LIMIT 5;
"""
pd.read_sql(q6, engine)

  first_name last_name  num_payments
0    ELEANOR      HUNT            46
1       KARL      SEAL            45
2     MARCIA      DEAN            42
3      CLARA      SHAW            42
4      TAMMY   SANDERS            41